Revit 2026 API

# GlobalParametersManagerFindByName Method

---

Finds whether a global parameter with the given name exists in the input document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ElementId FindByName(
	Document document,
	string name
)
```
```vb
Public Shared Function FindByName (
	document As Document,
	name As String
) As ElementId
```
```cpp
public:
static ElementId^ FindByName(
	Document^ document,
	String^ name
)
```
```fsharp
static member FindByName :
        document : Document *
        name : string -> ElementId
```

#### Parameters

document Document
     The document expected to contain the global parameter.
name String
     Name of the global parameter

#### Return Value

ElementId ElementId of the parameter element, or InvalidElementId if it was not found.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

No exception is thrown when no parameter with such a name exists in the document; instead, the method returns an ElementId.InvalidElementId.

#### Reference

GlobalParametersManager Class

Autodesk.Revit.DB Namespace